Tekla Open API Reference for Tekla Structures 2025
ProfileItem.IsProfileUserParametric Method
 Whether the profile is a parametric user-defined profile. If so, the prefix can be asked by type and subtype.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsProfileUserParametric()
Public Function IsProfileUserParametric As Boolean
Return Value
Type: Boolean
Whether the profile is a parametric user-defined profile or not.
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace